Amiya200/stm32_water_tank/Core/Src/model_handle.c
#include "model_handle.h"
#include "relay.h"
#include "led.h"
#include "global.h"
#include "adc.h"
#include "rtc_i2c.h"
#include "uart_commands.h"
#include "stm32f1xx_hal.h"
#include "eeprom_i2c.h"
#include "main.h"
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <stdlib.h>
#include <stdio.h>
extern I2C_HandleTypeDef hi2c2;
extern ADC_Data adcData;
extern RTC_Time_t time;
extern float g_currentA;
extern float g_voltageV;
#define TIMER_EE_SIGNATURE  0x544D
#define TIMER_EE_VERSION    1
#define EE_ADDR_TIMER_BLOCK 0x0600
typedef enum
{
    BUZZ_NONE = 0,
    BUZZ_TANK_FULL,
    BUZZ_TANK_EMPTY
} BuzzerEvent;

static BuzzerEvent activeBuzzEvent = BUZZ_NONE;

typedef struct {
    uint16_t signature;
    uint8_t  version;
    uint8_t  reserved;
    TimerSlot slots[5];
    uint16_t crc;
} TimerEEPROMBlock;
static uint16_t Timer_CRC16(const uint8_t *data, uint16_t len)
{
    uint16_t crc = 0xFFFF;
    while (len--) {
        crc ^= *data++;
        for (uint8_t i = 0; i < 8; i++)
            crc = (crc & 1) ? (crc >> 1) ^ 0xA001 : (crc >> 1);
    }
    return crc;
}
#define MOTOR_START_DELAY_MS   5000UL
#define TANK_FULL_DELAY_MS     20000UL
static uint32_t bootStartBlockUntil = 0;
static uint32_t tankFullDetectedAt  = 0;
static bool     tankFullPendingStop = false;
TimerSlot timerSlots[5];
static uint32_t autoRunStartMs = 0;
volatile bool manualActive    = false;
volatile bool semiAutoActive  = false;
volatile bool countdownActive = false;
volatile bool twistActive     = false;
volatile bool timerActive     = false;
volatile bool autoActive      = false;
#define DRY_PROBE_ON_MS   5000UL
#define DRY_CONFIRM_MS    1500UL
static uint32_t dryDeadline     = 0;
#define LOAD_FAULT_CONFIRM_MS 3000UL
#define LOAD_RETRY_RUN_MS     3000UL
#define LOAD_LOCK_DEFAULT_MS (20UL * 60UL * 1000UL)
#define TIMER_RETRY_30MIN_MS (30UL * 60UL * 1000UL)
static uint32_t buzzerAlertUntil = 0;
static uint32_t motorOnStartMs = 0;
static uint32_t powerOnMs     = 0;
static DryFSMState dryState      = DRY_IDLE;
volatile uint8_t motorStatus = 0;
volatile bool senseDryRun         = false;
volatile bool groundWater         = false;
volatile bool senseOverLoad       = false;
volatile bool senseUnderLoad      = false;
volatile bool senseOverUnderVolt  = false;
volatile bool senseMaxRunReached  = false;
volatile bool manualOverride      = false;
volatile uint16_t auto_retry_counter = 0;
volatile bool     countdownMode      = false;
volatile uint32_t countdownDuration  = 0;
TwistSettings twistSettings;
typedef struct {
    bool    manual_on;
    bool    semi_on;
    bool    timer_on;
    bool    countdown_on;
    bool    twist_on;
    bool    auto_on;
    bool    motor_on;
    uint8_t power_restore_mode;
} ModeState;
static ModeState modeState;
#define EE_ADDR_COUNTDOWN_BLOCK 0x0040
#define EE_ADDR_MODE_BLOCK     0x0080
#define EE_ADDR_AUTO_BLOCK     0x00C0
#define CD_SIGNATURE 0xCD55
void ModelHandle_CheckDryRun(void);
void ModelHandle_CheckLoadFault(void);
typedef enum {
    TIMER_STATE_ON,
    TIMER_STATE_OFF,
    TIMER_STATE_WATER_CONTINUOUS
} TimerState;
static TimerState timerState = TIMER_STATE_ON;
static uint32_t   timerStateDeadline = 0;
typedef struct{
    uint16_t sig;
    uint32_t remaining;
    uint8_t  active;
    uint16_t crc;
} CountdownBlock;
#define SEMI_TANK_FULL_DELAY_MS 10000UL
static uint8_t powerRestoreMode = 0;
SystemSettings sys = {
    .gap_time_s      = 120,
    .retry_count     = 3,
    .uv_limit        = 190,
    .ov_limit        = 270,
    .overload        = 0.0f,
    .underload       = 0.0f,
    .maxrun_min      = 300,
    .dry_run_time_s  = 60,
    .dry_run_enable  = 1
};
static inline void start_motor(void);
static inline void stop_motor(void);
static inline void clear_all_modes(void);
void ModelHandle_SoftDryRunHandler(void);
static void SaveCountdown(void);
static bool     timer_any_active_slot(void);
static uint16_t get_active_timer_gap_minutes(void);
static uint8_t  get_today_mask(void);
static bool     slot_is_active_now(const TimerSlot *t);
static bool     isTankFull(void);
static inline bool isAnyModeActive(void);
static void     auto_tick(void);
static void     twist_tick(void);
static void     leds_from_model(void);
typedef enum {
    MOTOR_OWNER_NONE = 0,
    MOTOR_OWNER_MANUAL,
    MOTOR_OWNER_SEMIAUTO,
    MOTOR_OWNER_TIMER,
    MOTOR_OWNER_COUNTDOWN,
    MOTOR_OWNER_TWIST,
    MOTOR_OWNER_AUTO,
    MOTOR_OWNER_RESTART
} MotorOwner;
static volatile MotorOwner motorOwner = MOTOR_OWNER_NONE;
typedef struct
{
    uint8_t pumpOnSound;
    uint8_t tankFullSound;
    uint8_t tankEmptySound;
} BuzzerSettings;
static BuzzerSettings buzzerSettings = {1,1,1};
static uint32_t cd_deadline = 0;
#define EE_ADDR_BUZZER_BLOCK 0x0500
typedef enum {
    LOAD_NORMAL = 0,
    LOAD_FAULT_WAIT,
    LOAD_FAULT_LOCK,
    LOAD_RETRY_RUN
} LoadFaultState;
uint32_t ap = 0 ;
#define RESTART_WATER_LOSS_CONFIRM_MS  5000UL
#define COUNTDOWN_GAP_MS   15000UL
typedef enum {
    CD_RUN_TEST = 0,
    CD_WAIT_GAP,
    CD_RUN_CONTINUOUS
} CountdownState;
static bool dr;
static LoadFaultState loadState = LOAD_NORMAL;
static MotorOwner previousOwner = MOTOR_OWNER_NONE;
static bool previousManual    = false;
static bool previousSemi      = false;
static bool previousCountdown = false;
static bool previousAuto      = false;
static uint16_t auto_gap_s = 120;
static uint16_t auto_maxrun_min  = 12;
static uint8_t  auto_retry_limit = 5;
static uint8_t  auto_retry_count = 0;
typedef enum {
    AUTO_IDLE = 0,
    AUTO_ON_WAIT,
    AUTO_DRY_CHECK,
    AUTO_OFF_WAIT
} AutoState;
#define MODE_SWITCH_DELAY_MS  3000UL
static bool     modeSwitchPending = false;
static uint32_t modeSwitchTime    = 0;
static bool restartActive = false;
static MotorOwner pendingOwner    = MOTOR_OWNER_NONE;
static AutoState autoState    = AUTO_IDLE;
static uint32_t autoDeadline = 0;
#define EE_ADDR_AUTO_RUNTIME  0x0340
#define AUTO_SIG 0xA055
static bool     twist_on_phase = false;
static uint32_t bootBlockUntil = 0;
#define RESTART_DRY_CONFIRM_MS 5000UL
static uint32_t twist_deadline = 0;
static bool autoBackgroundEnabled = true;
static bool autoUserLocked = false;
typedef struct __attribute__((packed))
{
    uint16_t sig;
    uint8_t  active;
    uint8_t  state;
    uint8_t  retryCount;
    uint32_t remaining_ms;
    uint8_t  crc;
} AutoRuntimeBlock;
