Amiya200/stm32_water_tank/Core/Src/model_handle.c
    if (modeSwitchPending)
    {
        if (now >= modeSwitchTime)
        {
            modeSwitchPending = false;
            motorOwner = pendingOwner;
        }
        return;
    }
    ModelHandle_CheckGroundWater();
    ModelHandle_CheckDryRun();
    bool dryEnabled = (sys.gap_time_s > 0);
    dr = dryEnabled;
    ModelHandle_CheckLoadFault();
    check_max_run();
    if (dryEnabled)
        ModelHandle_SoftDryRunHandler();
    bool protectionFault =
        senseOverLoad ||
        senseUnderLoad ||
        senseOverUnderVolt ||
        senseMaxRunReached;
    ModelHandle_ProcessTimerSlots();
    if (restartActive)
        motorOwner = MOTOR_OWNER_RESTART;
    else if (timerActive)
        motorOwner = MOTOR_OWNER_TIMER;
    else if (manualActive)
        motorOwner = MOTOR_OWNER_MANUAL;
    else if (semiAutoActive)
        motorOwner = MOTOR_OWNER_SEMIAUTO;
    else if (countdownActive)
        motorOwner = MOTOR_OWNER_COUNTDOWN;
    else if (twistActive)
        motorOwner = MOTOR_OWNER_TWIST;
    else if (autoActive)
        motorOwner = MOTOR_OWNER_AUTO;
    else
        motorOwner = MOTOR_OWNER_NONE;
    bool tankFull = isTankFull();
    if (tankFull)
    {
        if (motorOwner != MOTOR_OWNER_MANUAL)
        {
            stop_motor();
        }
    }
    if (Motor_GetStatus() && tankFull)
    {
        if (!tankFullPendingStop)
        {
            tankFullPendingStop = true;
            tankFullDetectedAt = now;
        }
        if ((now - tankFullDetectedAt) >= TANK_FULL_DELAY_MS)
        {
            if (motorOwner != MOTOR_OWNER_MANUAL)
                stop_motor();

            tankFullPendingStop = false;
        }
    }
    else
    {
        tankFullPendingStop = false;
    }
    static uint8_t prevLevel = 100;
    uint8_t currentLevel = get_tank_level_percent();
    if (currentLevel == 0 && prevLevel > 0)
    {
        if (buzzerSettings.tankEmptySound)
            Buzzer_StartEvent(BUZZ_TANK_EMPTY);
    }
    prevLevel = currentLevel;
    switch (motorOwner)
    {
    case MOTOR_OWNER_RESTART:
        if (tankFull)
        {
            stop_motor();
            restartActive = false;
            if (buzzerSettings.tankFullSound)
                Buzzer_StartEvent(BUZZ_TANK_FULL);
            restore_previous_mode();
            ModelHandle_SaveModeState();
            break;
        }
        if (protectionFault)
        {
            stop_motor();
            break;
        }
        start_motor();
        break;
    case MOTOR_OWNER_MANUAL:
        if (!protectionFault)
            start_motor();
        else
            stop_motor();
        break;
    case MOTOR_OWNER_SEMIAUTO:
        if (tankFull || protectionFault)
            stop_motor();
        break;
    case MOTOR_OWNER_TIMER:
        if (tankFull || protectionFault)
        {
            stop_motor();
            break;
        }
        start_motor();
        break;
    case MOTOR_OWNER_COUNTDOWN:
    {
        if (!countdownActive)
            break;

        if (now >= cd_deadline)
        {
            ModelHandle_StopCountdown();
            break;
        }
        countdownDuration = (cd_deadline - now) / 1000UL;
        if (tankFull || protectionFault)
        {
            ModelHandle_StopCountdown();
            break;
        }
        start_motor();
    }
    break;
    case MOTOR_OWNER_TWIST:
        if (tankFull || protectionFault)
        {
            stop_motor();
            break;
        }
        twist_tick();
        break;
    case MOTOR_OWNER_AUTO:
        if (protectionFault)
        {
            stop_motor();
            break;
        }
        auto_tick();
        break;
    default:
        stop_motor();
        break;
    }
    if ((motorOwner == MOTOR_OWNER_NONE ||
         motorOwner == MOTOR_OWNER_AUTO) &&
        !tankFull)
    {
        auto_mode_background_control();

        if (autoActive && is_schedule_allowing_run())
            autoState = AUTO_ON_WAIT;
    }
    leds_from_model();
    Buzzer_Update();
}
DryFSMState ModelHandle_GetDryState(void)
{
    return dryState;
}
void ModelHandle_ResetAll(void)
{
    clear_all_modes();
    stop_motor();
    senseDryRun        = false;
    senseOverLoad      = false;
    senseUnderLoad     = false;
    senseOverUnderVolt = false;
    senseMaxRunReached = false;
    countdownDuration = 0;
    UART_SendStatusPacket();
}
void ModelHandle_SetUserSettings(uint32_t gap_seconds,
                                 uint8_t  retry,
                                 uint16_t uv_limit,
                                 uint16_t ov_limit,
                                 int16_t  overload,
                                 int16_t  underload,
                                 uint16_t maxrun_min)
{
    if (gap_seconds > 86400UL)
        gap_seconds = 86400UL;
    sys.gap_time_s  = gap_seconds;
    sys.retry_count = retry;
    sys.uv_limit    = uv_limit;
    sys.ov_limit    = ov_limit;
    sys.overload    = (float)overload;
    sys.underload   = (float)underload;
    sys.maxrun_min  = maxrun_min;
    ModelHandle_SaveSettingsToEEPROM();
    if (autoActive)
    {
        uint32_t now = HAL_GetTick();
        uint32_t gapSec = (sys.gap_time_s == 0) ? 120 : sys.gap_time_s;
        autoDeadline = now + (gapSec * 1000UL);
    }
}

void ModelHandle_SetAutoSettings(uint16_t gap_s,
                                 uint16_t maxrun_min,
                                 uint8_t retry)
{
    auto_gap_s       = (gap_s < 30) ? 120 : gap_s;
    auto_maxrun_min  = maxrun_min;
    auto_retry_limit = retry;
    EEPROM_WriteBlockSafe(0x0300, (uint8_t*)&auto_gap_s, sizeof(auto_gap_s));
    EEPROM_WriteBlockSafe(0x0302, (uint8_t*)&auto_maxrun_min, sizeof(auto_maxrun_min));
    EEPROM_WriteBlockSafe(0x0304, (uint8_t*)&auto_retry_limit, sizeof(auto_retry_limit));
}

bool ModelHandle_IsAutoActive(void)
{
    return autoActive;
}
void ModelHandle_SaveCurrentStateToEEPROM(void)
{
    RTC_PersistState s;
    memset(&s, 0, sizeof(s));
    if      (manualActive)    s.mode = 1;
    else if (semiAutoActive)  s.mode = 2;
    else if (timerActive)     s.mode = 3;
    else if (countdownActive) s.mode = 4;
    else if (twistActive)     s.mode = 5;
    else if (autoActive)      s.mode = 6;
    RTC_SavePersistentState(&s);
}
void ModelHandle_SetTimerSlot(uint8_t slot,
                              uint8_t onH, uint8_t onM,
                              uint8_t offH, uint8_t offM)
{
    timerSlots[slot].onHour    = onH;
    timerSlots[slot].onMinute  = onM;
    timerSlots[slot].offHour   = offH;
    timerSlots[slot].offMinute = offM;
    timerSlots[slot].enabled   = 1;
}
void ModelHandle_SetDryRun(bool on)
{
    sys.gap_time_s = on ? (sys.gap_time_s ? sys.gap_time_s : 10) : 0;
}
void ModelHandle_SetOverLoad(bool on)
{
    sys.overload = on ? (sys.overload > 0.1f ? sys.overload : 9.0f) : 0.0f;
}
void ModelHandle_SetOverUnderVolt(bool on)
{
    if (!on)
    {
        sys.uv_limit = 0;
        sys.ov_limit = 0;
    }
    else
    {
        if (!sys.uv_limit) sys.uv_limit = 190;
        if (!sys.ov_limit) sys.ov_limit = 270;
    }
}
void ModelHandle_ClearMaxRunFlag(void)
{
    senseMaxRunReached = false;
}
const TimerSlot* ModelHandle_GetTimerSlots(void)
{
    return timerSlots;
}
void ModelHandle_ProcessUartCommand(const char* cmd)
{
    (void)cmd;
}
bool ModelHandle_IsOverload(void)
{
    return senseOverLoad;
}
bool ModelHandle_IsUnderload(void)
{
    return senseUnderLoad;
}
bool ModelHandle_IsDryRunActive(void)
{
    return senseDryRun;
}
bool ModelHandle_IsVoltageFault(void)
{
    return senseOverUnderVolt;
}
bool ModelHandle_IsMaxRunReached(void)
{
    return senseMaxRunReached;
}

uint8_t ModelHandle_GetTankLevelPercent(void)
{
    return get_tank_level_percent();
}

bool ModelHandle_IsTankFull(void)
{
    return isTankFull();
}
bool ModelHandle_IsManualActive(void)
{
    return manualActive;
}
uint16_t ModelHandle_GetAutoGap(void)
{
    return auto_gap_s;
}

uint16_t ModelHandle_GetAutoMaxRun(void)
{
    return auto_maxrun_min;
}

uint8_t ModelHandle_GetAutoRetry(void)
{
    return auto_retry_limit;
}
